cask_args appdir: "/Applications"

tap "caskroom/cask"

brew "asciinema"
brew "ctags"
brew "figlet"
brew "hub"
brew "phantomjs"
brew "postgresql", service_restart: true
brew "readline"
brew "sqlite"
brew "ssh-copy-id"
brew "ag"
brew "tmux"
brew "tree"
brew "tty-clock"
brew "watch"
brew "watchman"
brew "weechat", args: ["with-perl", "with-python"]
brew "wget"

cask "firefox"
cask "google-chrome"
cask "keycastr"
cask "evernote"

mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
mas "iA Writer", id: 775737590
