amariampolskiy.theme-apprentice
asvetliakov.vscode-neovim
christian-kohler.path-intellisense
Dart-Code.dart-code
Dart-Code.flutter
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
DotJoshJohnson.xml
dunstontc.viml
eamodio.gitlens
EditorConfig.EditorConfig
elixir-lsp.elixir-ls
esbenp.prettier-vscode
firefox-devtools.vscode-firefox-debug
freetonik.day-night-theme-switcher
geequlim.godot-tools
HaxeFoundation.haxe-hl
jaredly.reason-vscode
ms-dotnettools.csharp
ms-python.python
ms-vscode.cpptools
ms-vscode.mono-debug
ms-vscode.vscode-typescript-tslint-plugin
ms-vsliveshare.vsliveshare
msjsdiag.debugger-for-chrome
msjsdiag.vscode-react-native
nadako.vshaxe
rust-lang.rust
shinnn.stylelint
Unity.unity-debug
vscodevim.vim
vshaxe.haxe-debug
vshaxe.haxe-extension-pack
vshaxe.hxcpp-debugger
wayou.vscode-todo-highlight
wiggin77.codedox
xr0master.webstorm-intellij-darcula-theme
