# Repositories
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "neovim/neovim"

# CLI packages
brew "ack"
brew "asciinema"
brew "autoconf"
brew "carthage"
brew "clang-format"
brew "coreutils"
brew "ctags"
brew "direnv"
brew "fasd"
brew "figlet"
brew "fontforge"
brew "fzf"
brew "gmp"
brew "gnu-tar"
brew "gnupg"
brew "heroku/brew/heroku"
brew "htop"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "libyaml"
brew "macvim", args: ["with-override-system-vim", "with-python@2"]
brew "msgpack"
brew "neofetch"
brew "neovim", args: ["HEAD"]
brew "ocaml"
brew "opam"
brew "openssl"
brew "packer"
brew "phantomjs"
brew "postgresql", restart_service: true
brew "qt@5.5"
brew "redis", restart_service: true
brew "rename"
brew "sqlite"
brew "ssh-copy-id"
brew "the_silver_searcher"
brew "thefuck"
brew "tmux"
brew "trash"
brew "tree"
brew "tty-clock"
brew "watch"
brew "wget"
brew "wxmac"
brew "zlib"

# macOS applications
cask "1password"
cask "alfred"
cask "aseprite"
cask "bartender"
cask "blender"
cask "caffeine"
cask "clip-studio-paint"
cask "daisydisk"
cask "dash"
cask "discord"
cask "docker"
cask "dropbox"
cask "duet"
cask "evernote"
cask "fantastical"
cask "firefox"
cask "github"
cask "google-chrome"
cask "google-chrome-canary"
cask "harvest"
cask "itch"
cask "iterm2"
cask "kaleidoscope"
cask "karabiner-elements"
cask "keycastr"
cask "ngrok"
cask "paw"
cask "postico"
cask "postman"
cask "reaper"
cask "rightfont"
cask "scrivener"
cask "sketch"
cask "sketchbook"
cask "slack"
cask "spotify"
cask "statusfy"
cask "steam"
cask "tiled"
cask "unity-hub"
cask "virtualbox"
cask "visual-studio-code"
cask "xscreensaver"
cask "zoomus"

# Mac App Store
mas "GarageBand", id: 682658836
mas "Magnet", id: 441258766
mas "Spark", id: 1176895641
mas "Unclutter", id: 577085396
mas "Xcode", id: 497799835
