tap 'caskroom/cask'
tap 'railwaycat/emacsmacport'

brew 'asciinema'
brew 'cabal-install'
brew 'ctags'
brew 'figlet'
brew 'go'
brew 'haskell-stack'
brew 'htop'
brew 'hub'
brew 'imagemagick'
brew 'libyaml'
brew 'lua'
brew 'lynx'
brew 'macvim'
brew 'markdown'
brew 'phantomjs'
brew 'postgresql', service_restart: true
brew 'railwaycat/emacsmacport/emacs-mac', args: ['with-imagemagick', 'with-official-icon']
brew 'readline'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'tty-clock'
brew 'watch'
brew 'watchman'
brew 'weechat', args: ['with-perl', 'with-python']
brew 'wget'

cask 'google-chrome'
cask 'haskell-platform'
cask 'keycastr'

mas 'Microsoft OneNote', id: 784801555
mas 'Pixen', id: 525180431
mas 'The Unarchiver', id: 425424353
mas 'Xcode', id: 497799835
mas 'iA Writer', id: 775737590